Tekla Open API Reference for Tekla Structures 2025
ShapeItem Methods
The ShapeItem type exposes the following members.
Methods
Name | Description
CleanAndModify
 Cleans and stores the brep into the shape catalog
Delete
 Deletes a shape from shape catalog based on the shape name.
DeleteMetadata
 Delete the Shape item's metadata.
Export
 Exports the shape item in *.tsc-format to the to given file name. If path is not given shape is exported to model folder. If filename is empty shape name is used as filename.
GetAllMetadataKeys
 Get the Shape item's metadata keys.
GetInstanceCount
 Get the number of instances used in the model of a shape
GetMetadata
 Get the Shape item's metadata.
Insert
 Inserts a shape to the shape catalog based on the shape geometry (does not allow duplicate geometry).
InsertOrGetGuidsOfShapesWithMatchingGeometry
 Inserts a shape to the shape catalog based on the shape geometry (does not allow duplicate geometry). If, based on fingerprint, the geometry already exists it populates a list of Guids of shapes using that same geometry.
InsertUsingNormals
 Inserts a shape to the shape catalog using the shape geometry. Uses vertex normals to determine edge visibility. If the normal vectors of the vertices belonging to one geometrical location are close enough, the edge will be considered smooth and will be marked as hidden.
InsertUsingNormalsAllowDuplicates
 Inserts a shape to the shape catalog using the shape geometry allowing duplicates. Uses vertex normals to determine edge visibility. If the normal vectors of the vertices belonging to one geometrical location are close enough, the edge will be considered smooth and will be marked as hidden.
Modify
 Modifies a shape in the shape catalog based on the shape name or if not found, based on shape guid.
Rename
 Renames a shape in the shape catalog with the given shape name.
Select()
 Selects the shape from the database based on the name given in this instance.
Select(String)
 Selects the shape based on the given name from the database.
SetHandlePoints
 Set the Shape item's Handle Points
SetMetadata
 Set the Shape item's metadata. Inserts the metadata if key is not found, otherwise modifies existing data.
Top
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace